In [1]:
import numpy as np
import pandas as pd

In [8]:
labels=['A','B','C']
my_list=[10,20,30]
arr=np.array([20,10,30])
my_dict={1:20,2:50,3:40}

In [16]:
pd.Series(my_dict)

1    20
2    50
3    40
dtype: int64

In [18]:
data={'Name':['Sid','Priya','Ayush','Ronit'],
     'Age':[21,20,20,28],
     'City':['Amd','Amd','Amd','Amd']}
df=pd.DataFrame(data)

In [19]:
df

    Name  Age City
0    Sid   21  Amd
1  Priya   20  Amd
2  Ayush   20  Amd
3  Ronit   28  Amd

In [25]:
data_list=['Sid',21,'Amd'],['Priya',20,'Amd'],['Ayush',20,'Amd']
columns=['Name','Age','City']
df1=pd.DataFrame(data_list,columns=columns)
df2=pd.DataFrame(data_list)
df2

       0   1    2
0    Sid  21  Amd
1  Priya  20  Amd
2  Ayush  20  Amd

In [26]:
df1

    Name  Age City
0    Sid   21  Amd
1  Priya   20  Amd
2  Ayush   20  Amd

In [36]:
df1[['Name','Age']]

    Name  Age
0    Sid   21
1  Priya   20
2  Ayush   20

In [39]:
df1['ClothSize']=['M','M','L']#Creates a column
df1

    Name  Age City ClothSize
0    Sid   21  Amd         M
1  Priya   20  Amd         M
2  Ayush   20  Amd         L

In [42]:
df1.drop('ClothSize',axis = 1)#just removes it for specific cell where used

    Name  Age City
0    Sid   21  Amd
1  Priya   20  Amd
2  Ayush   20  Amd

In [44]:
df1.drop('ClothSize',axis = 1,inplace=True)#Removes completely

In [56]:
df1.loc[[0,1]]#Selects rows
df1.iloc[0]#Selects columns

Name    Sid
Age      21
City    Amd
Name: 0, dtype: object

In [61]:
df1.loc[[0,1]][['City','Name']]

  City   Name
0  Amd    Sid
1  Amd  Priya

In [64]:
df.iloc[[1,2]][['Name','Age']]

    Name  Age
1  Priya   20
2  Ayush   20

In [73]:
df[(df['Age']<25) & (df['Name']=='Priya')]

    Name  Age City
1  Priya   20  Amd